#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>

#+LATEX_HEADER: \usepackage{mathtools}


* Basic Tests
  :PROPERTIES:
  :header-args: :noweb yes :results output replace :results replace drawer :exports both :import category :noweb no-export
  :END:

  #+BEGIN_SRC D
    import category;
    auto U = new immutable CatObject(Vec, "U");
    auto V = new immutable CatObject(Vec, "V");

    auto A = new immutable Morphism(Vec, U, V, "A");
    auto B = new immutable Morphism(Vec, V, U, "B");

    auto u = new immutable Element(U, "u");

    A.lprint;
    A.grad.lprint;
    A.grad.cprint;

    writeln("\n");

    A.grad()(u).lprint;

    writeln("\n");

    compose(B,A).grad.lprint;
    compose(B,A).grad()(u).lprint;

    writeln("\n");

    A.grad.grad.lprint;
    A.grad.grad.cprint;
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  \begin{align}
  U \xrightharpoonup[]{A} V
  \end{align}
  \begin{align}
  U \xhookrightarrow[]{\left( \text{Elem}_{A} \circ 0 \right)} \left( U \xrightharpoonup[]{} V \right)
  \end{align}
  \begin{align}
  U \xrightharpoonup[]{0} \{\emptyset\} \xhookrightarrow[]{\text{Elem}_{A}} \left( U \xrightharpoonup[]{} V \right)
  \end{align}


  \begin{align}
  U \xrightharpoonup[]{A} V
  \end{align}


  \begin{align}
  U \xhookrightarrow[]{\left( \text{Elem}_{\left( B \circ A \right)} \circ 0 \right)} \left( U \xrightharpoonup[]{} U \right)
  \end{align}
  \begin{align}
  U \xrightharpoonup[]{\left( B \circ A \right)} U
  \end{align}


  \begin{align}
  U \xrightharpoonup[]{\left( 0 \circ 0 \right)} \left( U \xrightharpoonup[]{} \left( U \xrightharpoonup[]{} V \right) \right)
  \end{align}
  \begin{align}
  U \xrightharpoonup[]{0} \{\emptyset\} \xrightharpoonup[]{0} \left( U \xrightharpoonup[]{} \left( U \xrightharpoonup[]{} V \right) \right)
  \end{align}
  :END:

  #+BEGIN_SRC D
    import category;
    auto U = new immutable CatObject(Vec, "U");
    auto V = new immutable CatObject(Vec, "V");

    auto u = new immutable Element(U, "u");

    auto f = new immutable Morphism(Smooth, U, V, "f");
    auto g = new immutable Morphism(Smooth, V, U, "g");

    f.lprint;
    f.grad.lprint;
    f.grad()(u).lprint;

    writeln();

    compose(g,f).grad.lprint;
    compose(g,f).grad()(u).lprint;

    writeln();

    f.grad.grad.lprint;
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  \begin{align}
  U \xmapsto[\infty]{f} V
  \end{align}
  \begin{align}
  U \xmapsto[\infty]{\nabla \left( f \right)} \left( U \xrightharpoonup[]{} V \right)
  \end{align}
  \begin{align}
  U \xrightharpoonup[]{\nabla \left( f \right) \left( u \right)} V
  \end{align}

  \begin{align}
  U \xmapsto[\infty]{\left( \text{hom} \circ \left( \left( \nabla \left( g \right) \circ f \right) \times \nabla \left( f \right) \right) \right)} \left( U \xrightharpoonup[]{} U \right)
  \end{align}
  \begin{align}
  U \xrightharpoonup[]{\left( \nabla \left( g \right) \left( f \left( u \right) \right) \circ \nabla \left( f \right) \left( u \right) \right)} U
  \end{align}

  \begin{align}
  U \xmapsto[\infty]{\nabla \left( \nabla \left( f \right) \right)} \left( U \xrightharpoonup[]{} \left( U \xrightharpoonup[]{} V \right) \right)
  \end{align}
  :END:


  #+BEGIN_SRC D

    import category;
    auto U = new immutable CatObject(Vec, "U");

    auto x = new immutable Element(U, "x");
    auto y = new immutable Element(U, "y");

    auto F = new immutable Morphism(Smooth, productObject(U,U), U, "F");
    auto f = new immutable Morphism(Smooth, U, U, "f");
    auto g = new immutable Morphism(Smooth, U, U, "g");

    F.lprint;
    f.lprint;
    g.lprint;

    writeln("\n");
    
    auto foo = compose(F, product(compose(F, product(f,g)), f));
    foo.lprint;
    foo(x).lprint;

    writeln("\n");
    
    auto bar = foo(x).extractElement(f(x));
    bar.lprint;
    bar(y).lprint;

    writeln("\n");

    bar.extractElement(F).lprint;
    
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  \begin{align}
  \left( U \times U \right) \xmapsto[\infty]{F} U
  \end{align}
  \begin{align}
  U \xmapsto[\infty]{f} U
  \end{align}
  \begin{align}
  U \xmapsto[\infty]{g} U
  \end{align}


  \begin{align}
  U \xmapsto[\infty]{\left( F \circ \left( \left( F \circ \left( f \times g \right) \right) \times f \right) \right)} U
  \end{align}
  \begin{align}
  F \left( \left( F \left( \left( f \left( x \right) , g \left( x \right) \right) \right) , f \left( x \right) \right) \right) \in U
  \end{align}


  \begin{align}
  U \xmapsto[\infty]{\left( F \circ \left( \left( F \circ \left( \text{id}_{U} \times \left( \text{Elem}_{g \left( x \right)} \circ 0 \right) \right) \right) \times \text{id}_{U} \right) \right)} U
  \end{align}
  \begin{align}
  F \left( \left( F \left( \left( y , g \left( x \right) \right) \right) , y \right) \right) \in U
  \end{align}


  \begin{align}
  \left( \left( U \times U \right) \xmapsto[\infty]{} U \right) \xmapsto[\infty]{\left( \text{hom} \circ \left( \text{id}_{\left( \left( U \times U \right) \xmapsto[\infty]{} U \right)} \times \left( \text{Prod} \circ \left( \left( \text{hom} \circ \left( \text{id}_{\left( \left( U \times U \right) \xmapsto[\infty]{} U \right)} \times \left( \text{Elem}_{\left( \text{id}_{U} \times \left( \text{Elem}_{g \left( x \right)} \circ 0 \right) \right)} \circ 0 \right) \right) \right) \times \left( \text{Elem}_{\text{id}_{U}} \circ 0 \right) \right) \right) \right) \right)} \left( U \xmapsto[\infty]{} U \right)
  \end{align}
  :END:


  #+BEGIN_SRC D
    import category;
    auto U = new immutable CatObject(Vec, "U");
    auto V = new immutable CatObject(Vec, "V");

    auto x = new immutable Element(U, "x");
    auto dx = new immutable Element(U, "dx", "\\delta x");

    auto f = new immutable Morphism(Smooth, U, U, "f");
    auto g = new immutable Morphism(Smooth, U, U, "g");

    compose(f,g).grad.lprint;
    compose(f,g).grad()(x).lprint;
    compose(f,g).grad()(x)(dx).lprint;

    writeln("\n");

    compose(f,g).grad().extractElement(g).lprint;
    compose(f,g).grad().extractElement(g)(g).lprint;

    //compose(g,f).grad()(u).extractElement(g).extractElement(f).lprint;
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  \begin{align}
  U \xmapsto[\infty]{\left( \text{hom} \circ \left( \left( \nabla \left( f \right) \circ g \right) \times \nabla \left( g \right) \right) \right)} \left( U \xrightharpoonup[]{} U \right)
  \end{align}
  \begin{align}
  U \xrightharpoonup[]{\left( \nabla \left( f \right) \left( g \left( x \right) \right) \circ \nabla \left( g \right) \left( x \right) \right)} U
  \end{align}
  \begin{align}
  \nabla \left( f \right) \left( g \left( x \right) \right) \left( \nabla \left( g \right) \left( x \right) \left( \delta x \right) \right) \in U
  \end{align}


  \begin{align}
  \left( U \xmapsto[\infty]{} U \right) \xmapsto[\infty]{\left( \text{hom} \circ \left( \left( \text{Elem}_{\text{hom}} \circ 0 \right) \times \left( \text{Prod} \circ \left( \left( \text{hom} \circ \left( \left( \text{Elem}_{\nabla \left( f \right)} \circ 0 \right) \times \text{id}_{\left( U \xmapsto[\infty]{} U \right)} \right) \right) \times \nabla \right) \right) \right) \right)} \left( U \xmapsto[\infty]{} \left( U \xrightharpoonup[]{} U \right) \right)
  \end{align}
  \begin{align}
  U \xmapsto[\infty]{\left( \text{hom} \circ \left( \left( \nabla \left( f \right) \circ g \right) \times \nabla \left( g \right) \right) \right)} \left( U \xrightharpoonup[]{} U \right)
  \end{align}
  :END:

  #+BEGIN_SRC D
    import category;
    auto U = new immutable CatObject(Vec, "U");
    auto V = new immutable CatObject(Vec, "V");

    auto u = new immutable Element(U, "u");
    auto v = new immutable Element(V, "v");

    auto f = new immutable Morphism(Smooth, U, V, "f");
    auto g = new immutable Morphism(Smooth, V, U, "g");

    auto A = new immutable Morphism(Smooth, U, U, "A");
    auto B = new immutable Morphism(Smooth, U, U, "B");

    auto inv = inversion(A.set());

    inv.lprint;
    inv.grad.lprint;

    inv(A).lprint;
    inv.grad()(A)(B).lprint;    
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  \begin{align}
  \left( U \xmapsto[\infty]{} U \right) \xmapsto[\infty]{\text{inv}} \left( U \xmapsto[\infty]{} U \right)
  \end{align}
  \begin{align}
  \left( U \xmapsto[\infty]{} U \right) \xmapsto[\infty]{\left( \text{hom} \circ \left( \left( \text{Elem}_{\text{hom}} \circ 0 \right) \times \left( \text{Prod} \circ \left( \left( \text{Elem}_{\left( \text{Elem}_{\text{Eval}} \circ 0 \right)} \circ 0 \right) \times \left( \text{hom} \circ \left( \left( \text{Elem}_{\text{Prod}} \circ 0 \right) \times \left( \text{Prod} \circ \left( \left( \text{hom} \circ \left( \left( \text{Elem} \circ \left( \text{hom} \circ \left( \left( \text{Elem}_{\text{inv}} \circ 0 \right) \times \left( \text{hom} \circ \left( \nabla \times \text{inv} \right) \right) \right) \right) \right) \times \left( \text{Elem}_{0} \circ 0 \right) \right) \right) \times \left( \text{hom} \circ \left( \left( \text{Elem}_{\text{hom}} \circ 0 \right) \times \left( \text{Prod} \circ \left( \left( \text{Elem}_{\text{id}_{\left( U \xmapsto[\infty]{} U \right)}} \circ 0 \right) \times \left( \text{hom} \circ \left( \left( \text{Elem} \circ \text{inv} \right) \times \left( \text{Elem}_{0} \circ 0 \right) \right) \right) \right) \right) \right) \right) \right) \right) \right) \right) \right) \right) \right) \right)} \left( \left( U \xmapsto[\infty]{} U \right) \xmapsto[\infty]{} \left( U \xmapsto[\infty]{} U \right) \right)
  \end{align}
  \begin{align}
  U \xmapsto[\infty]{\text{inv} \left( A \right)} U
  \end{align}
  \begin{align}
  U \xmapsto[\infty]{\left( \text{Eval} \circ \left( \left( \text{inv} \circ \left( \nabla \left( A \right) \circ \text{inv} \left( A \right) \right) \right) \times \left( B \circ \text{inv} \left( A \right) \right) \right) \right)} U
  \end{align}
  :END:


  # Local Variables:
  # org-confirm-babel-evaluate: nil
  # End:
